/* ѕустые места
¬аша «јƒј„ј - вз€ть фрагмент из кучи и заменить пропущенные участки программы.
Ќ≈Ћ№«я использовать один фрагмент несколько раз, и не все из них вам понадоб€тс€.
÷≈Ћ№ - создать класс, котрый скомпилируетс€ и выведет на экран приведенный ниже текст.
Ќе обольщайтесь - это сложнее, чем вы думаете

-= –езультат =-

% java ѕустыећеста
a noise
annoys
an oyster

*/
class ѕустыећеста{
  public static void main(String [] args){
    int x = 0;
    while(__________){
      ______________________
      if( x < 1){
        ____________________________
      }
      ______________________________
      if(_____________){
        ____________________________
        _______________
      }
      if( x == 1 ){
        ____________________________
      }
      
      if(_____________){
        ____________________________
      }
      System.out.println("");
      ______________
    }
  }

}

/*    уча 1                              уча 2             уча 3               уча 4
System.out.print(" ");                  x > 0           x = x + 1;        System.out.print("noys ");
System.out.print("a");                  x < 1           x = x + 2;        System.out.print("oise ");
System.out.print("n");                  x > 1           x = x - 2;        System.out.print(" oyster ");
System.out.print("an");                 x > 3           x = x - 1;        System.out.print("annoys");
                                        x < 4                             System.out.print("noise");
*/                                        

