/* Пустые места
Ваша ЗАДАЧА - взять фрагмент из кучи и заменить пропущенные участки программы.
НЕЛЬЗЯ использовать один фрагмент несколько раз, и не все из них вам понадобятся.
ЦЕЛЬ - создать класс, котрый скомпилируется и выведет на экран приведенный ниже текст.
Не обольщайтесь - это сложнее, чем вы думаете

-= Результат =-
% java ПустыеМеста
a noise
annoys
an oyster

*/
class ПустыеМеста{
  public static void main(String [] args){
    int x = 0;
    while(__________){
      ______________________
      if( x < 1){
        ____________________________
      }
      ______________________________
      if(_____________){
        ____________________________
        _______________
      }
      if( x == 1 ){
        ____________________________
      }
      
      if(_____________){
        ____________________________
      }
      System.out.println("");
      ______________
    }
  }

}

/*   куча 1                             куча 2            куча 3              куча 4
System.out.print(" ");                  x > 0           x = x + 1;        System.out.print("noys ");
System.out.print("a");                  x < 1           x = x + 2;        System.out.print("oise ");
System.out.print("n");                  x > 1           x = x - 2;        System.out.print(" oyster ");
System.out.print("an");                 x > 3           x = x - 1;        System.out.print("annoys");
                                        x < 4                             System.out.print("noise");
*/                                        

